Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУдостоверяющийЛичность</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговыйНомер</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвидетельствоДатаВыдачи</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойКонтрагент</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЮрФизЛицо</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКПО</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвидетельствоСерияНомер</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаРегистрации</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидГосударственногоОргана</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыГосударственныхОрганов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодГосударственногоОргана</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АЭ_Идентификатор</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННВведенКорректно</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическоеФизическоеЛицо</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ЮридическоеФизическоеЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КППВведенКорректно</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АЭ_ИндивидуальныйПредприниматель</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ЮридическоеФизическоеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ЮридическоеФизическоеЛицо</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/БанковскиеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>БанковскиеСчета</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДенежныхСредств</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>34</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Контрагенты/Ext/ManagerModule.bsl
Функция СтруктураКонтрагент(Объект) Экспорт
	СтруктураОбмена = Новый Структура;
	СтруктураОбмена.Вставить("Код",Объект.Код);
	СтруктураОбмена.Вставить("ИНН",Объект.ИНН);
	СтруктураОбмена.Вставить("КПП",Объект.КПП);
	СтруктураОбмена.Вставить("РодительКод",Объект.Родитель.Код);
	СтруктураОбмена.Вставить("Наименование",Объект.Наименование);
	СтруктураОбмена.Вставить("НаименованиеПолное",Объект.НаименованиеПолное);
	СтруктураОбмена.Вставить("НаименованиеПолное",Объект.НаименованиеПолное);
	СтруктураОбмена.Вставить("Комментарий",Объект.Комментарий);
	
	//СтруктураОбмена.Вставить("ЮридическоеФизическоеЛицо",?(Объект.ЮридическоеФизическоеЛицо=Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо,"ФизическоеЛицо","ЮридическоеЛицо"));
	Если Объект.АЭ_ИндивидуальныйПредприниматель 
	 ИЛИ Объект.БНФОЮрФизЛицо = Перечисления.БНФОЮрФизЛицо.ИндивидуальныйПредприниматель
	 ИЛИ Объект.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
		СтруктураОбмена.Вставить("ЮридическоеФизическоеЛицо", "ЮридическоеЛицо");
	Иначе
		СтруктураОбмена.Вставить("ЮридическоеФизическоеЛицо", "ФизическоеЛицо");
	КонецЕсли;
	 
	МассивКИ = Новый Массив;
	Для Каждого СтрокаТЧ Из Объект.КонтактнаяИнформация Цикл
		СтруктураОбменаКИ = Новый Структура;
		//
		Если СтрокаТЧ.Тип  = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
			СтруктураОбменаКИ.Вставить("Тип","Адрес");
			СтруктураОбменаКИ.Вставить("Регион",лев(СтрокаТЧ.Представление,6));
		КонецЕсли; 
		//
		Если СтрокаТЧ.Тип  = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			СтруктураОбменаКИ.Вставить("Тип","Телефон");
			СтруктураОбменаКИ.Вставить("НомерТелефона",СтрокаТЧ.Представление);
		КонецЕсли; 
		//
		Если СтрокаТЧ.Тип  = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
			СтруктураОбменаКИ.Вставить("Тип","АдресЭлектроннойПочты");
		КонецЕсли; 
		//
		Если СтрокаТЧ.Тип  = Перечисления.ТипыКонтактнойИнформации.Skype Тогда
			СтруктураОбменаКИ.Вставить("Тип","Skype");
		КонецЕсли; 
		//
		Если СтрокаТЧ.Тип  = Перечисления.ТипыКонтактнойИнформации.ВебСтраница Тогда
			СтруктураОбменаКИ.Вставить("Тип","ВебСтраница");
		КонецЕсли; 
		//
		Если СтрокаТЧ.Тип  = Перечисления.ТипыКонтактнойИнформации.Факс Тогда
			СтруктураОбменаКИ.Вставить("Тип","Факс");
		КонецЕсли; 
		//
		Если СтрокаТЧ.Тип  = Перечисления.ТипыКонтактнойИнформации.Другое Тогда
			СтруктураОбменаКИ.Вставить("Тип","Другое");
		КонецЕсли; 
		//
		Если СтрокаТЧ.Вид  = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента Тогда
			СтруктураОбменаКИ.Вставить("Вид","ФактАдресКонтрагента");
		КонецЕсли; 
		//
		Если СтрокаТЧ.Вид  = Справочники.ВидыКонтактнойИнформации.EmailКонтрагенты Тогда
			СтруктураОбменаКИ.Вставить("Вид","EmailКонтрагенты");
		КонецЕсли; 
		//
		Если СтрокаТЧ.Вид  = Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияКонтрагенты Тогда
			СтруктураОбменаКИ.Вставить("Вид","ДругаяИнформацияКонтрагенты");
		КонецЕсли; 
		//
		Если СтрокаТЧ.Вид  = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресКонтрагента Тогда
			СтруктураОбменаКИ.Вставить("Вид","ПочтовыйАдресКонтрагента");
		КонецЕсли; 
		//
		Если СтрокаТЧ.Вид  = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента Тогда
			СтруктураОбменаКИ.Вставить("Вид","ТелефонКонтрагента");
		КонецЕсли; 
		//
		Если СтрокаТЧ.Вид  = Справочники.ВидыКонтактнойИнформации.ФаксКонтрагенты Тогда
			СтруктураОбменаКИ.Вставить("Вид","ФаксКонтрагенты");
		КонецЕсли; 
		//
		Если СтрокаТЧ.Вид  = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента Тогда
			СтруктураОбменаКИ.Вставить("Вид","ЮрАдресКонтрагента");
		КонецЕсли; 
		СтруктураОбменаКИ.Вставить("Представление",СтрокаТЧ.Представление);
		МассивКИ.Добавить(СтруктураОбменаКИ);	
	КонецЦикла;   
	СтруктураОбмена.Вставить("КИ",МассивКИ);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	БанковскиеСчета.Код КАК Код,
	|	БанковскиеСчета.Наименование КАК Наименование,
	|	БанковскиеСчета.НомерСчета КАК НомерСчета,
	|	БанковскиеСчета.Банк КАК Банк,
	|	БанковскиеСчета.Валютный КАК Валютный,
	|	БанковскиеСчета.ВалютаДенежныхСредств КАК ВалютаДенежныхСредств,
	|	БанковскиеСчета.НомерИДатаРазрешения КАК НомерИДатаРазрешения,
	|	БанковскиеСчета.ДатаОткрытия КАК ДатаОткрытия,
	|	БанковскиеСчета.ДатаЗакрытия КАК ДатаЗакрытия,
	|	БанковскиеСчета.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	БанковскиеСчета.БанкДляРасчетов КАК БанкДляРасчетов,
	|	БанковскиеСчета.ВидСчета КАК ВидСчета,
	|	БанковскиеСчета.ТекстКорреспондента КАК ТекстКорреспондента,
	|	БанковскиеСчета.ТекстНазначения КАК ТекстНазначения,
	|	БанковскиеСчета.МесяцПрописью КАК МесяцПрописью,
	|	БанковскиеСчета.СуммаБезКопеек КАК СуммаБезКопеек,
	|	БанковскиеСчета.ВсегдаУказыватьКПП КАК ВсегдаУказыватьКПП,
	|	БанковскиеСчета.БНФОГруппаФинансовогоУчета КАК БНФОГруппаФинансовогоУчета,
	|	БанковскиеСчета.ГосударственныйКонтракт КАК ГосударственныйКонтракт,
	|	БанковскиеСчета.БНФОСвязанныйКонтрагент КАК БНФОСвязанныйКонтрагент,
	|	БанковскиеСчета.БНФОГруппаФинансовогоУчетаДенежныеСредстваВПути КАК БНФОГруппаФинансовогоУчетаДенежныеСредстваВПути,
	|	БанковскиеСчета.АЭ_ВидСчетаДляРеестра КАК АЭ_ВидСчетаДляРеестра,
	|	БанковскиеСчета.СчетКорпоративныхРасчетов КАК СчетКорпоративныхРасчетов,
	|	БанковскиеСчета.СчетБанк КАК СчетБанк,
	|	БанковскиеСчета.Банк.Код КАК БанкКод,
	|	БанковскиеСчета.Банк.Наименование КАК БанкНаименование,
	|	БанковскиеСчета.Банк.КоррСчет КАК БанкКоррСчет,
	|	БанковскиеСчета.Банк.Город КАК БанкГород,
	|	БанковскиеСчета.Банк.Адрес КАК БанкАдрес,
	|	БанковскиеСчета.Банк.Телефоны КАК БанкТелефоны,
	|	БанковскиеСчета.Банк.СВИФТБИК КАК БанкСВИФТБИК
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Владелец = &Владелец
	|	ИЛИ БанковскиеСчета.БНФОСвязанныйКонтрагент = &Владелец";
	Запрос.УстановитьПараметр("Владелец",Объект);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураОбмена.Вставить("БанкКод",Выборка.БанкКод);
		СтруктураОбмена.Вставить("БанкНаименование",Выборка.БанкНаименование);
		СтруктураОбмена.Вставить("БанкКоррСчет",Выборка.БанкКоррСчет);
		СтруктураОбмена.Вставить("БанкГород",Выборка.БанкГород);
		СтруктураОбмена.Вставить("БанкАдрес",Выборка.БанкАдрес);
		СтруктураОбмена.Вставить("БанкТелефоны",Выборка.БанкТелефоны);
		СтруктураОбмена.Вставить("СчетНаименование",Выборка.Наименование);
		СтруктураОбмена.Вставить("НомерСчета",Выборка.НомерСчета);
		СтруктураОбмена.Вставить("ТекстКорреспондента",Выборка.ТекстКорреспондента);
		СтруктураОбмена.Вставить("ДатаОткрытия",Выборка.ДатаОткрытия);
		СтруктураОбмена.Вставить("ДатаЗакрытия",Выборка.ДатаЗакрытия);
		СтруктураОбмена.Вставить("ТекстНазначенияПлатежа",Выборка.ТекстНазначения);
	КонецЦикла;
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON,СтруктураОбмена ); 
	Возврат ЗаписьJSON.Закрыть();
КонецФункции
